HermanoLCampos/f28386D-QPC/Cores_Project/CPU1/vpu_mvp_board_s.syscfg
gpio2.$name             = "LED2";
gpio2.direction         = "GPIO_DIR_MODE_OUT";
gpio2.controllerCore    = "GPIO_CORE_CPU2";
gpio2.writeInitialValue = true;
gpio2.initialValue      = 1;
gpio2.gpioPin.$assign   = "GPIO8";

gpio3.$name             = "LED3";
gpio3.direction         = "GPIO_DIR_MODE_OUT";
gpio3.writeInitialValue = true;
gpio3.initialValue      = 1;
gpio3.controllerCore    = "GPIO_CORE_CM";
gpio3.gpioPin.$assign   = "GPIO99";

gpio4.direction         = "GPIO_DIR_MODE_OUT";
gpio4.writeInitialValue = true;
gpio4.initialValue      = 1;
gpio4.$name             = "LED4";
gpio4.gpioPin.$assign   = "GPIO21";

gpio5.$name             = "RTD_CSA";
gpio5.direction         = "GPIO_DIR_MODE_OUT";
gpio5.writeInitialValue = true;
gpio5.initialValue      = 1;
gpio5.gpioPin.$assign   = "GPIO35";

gpio6.$name             = "RTD_CSB";
gpio6.direction         = "GPIO_DIR_MODE_OUT";
gpio6.writeInitialValue = true;
gpio6.initialValue      = 1;
gpio6.gpioPin.$assign   = "GPIO48";

gpio7.$name             = "RTD_MUX_A0";
gpio7.direction         = "GPIO_DIR_MODE_OUT";
gpio7.writeInitialValue = true;
gpio7.gpioPin.$assign   = "GPIO30";

gpio8.$name             = "RTD_MUX_A1";
gpio8.direction         = "GPIO_DIR_MODE_OUT";
gpio8.writeInitialValue = true;
gpio8.gpioPin.$assign   = "GPIO28";

gpio9.$name             = "RTD_MUX_B0";
gpio9.direction         = "GPIO_DIR_MODE_OUT";
gpio9.writeInitialValue = true;
gpio9.gpioPin.$assign   = "GPIO29";

gpio10.$name             = "RTD_MUX_B1";
gpio10.direction         = "GPIO_DIR_MODE_OUT";
gpio10.writeInitialValue = true;
gpio10.gpioPin.$assign   = "GPIO31";

gpio11.$name                     = "RTD_DRDYA";
gpio11.useInterrupt              = true;
gpio11.gpioPin.$assign           = "GPIO40";
gpio11.xint.enableInt            = true;
gpio11.xint.registerInterrupts   = true;
gpio11.xint.xInt.enableInterrupt = true;

gpio12.$name           = "RTD_DRDYB";
gpio12.gpioPin.$assign = "GPIO41";

gpio13.$name             = "GD_EN1";
gpio13.direction         = "GPIO_DIR_MODE_OUT";
gpio13.writeInitialValue = true;
gpio13.initialValue      = 1;
gpio13.gpioPin.$assign   = "GPIO89";

gpio14.$name             = "GD_EN2";
gpio14.direction         = "GPIO_DIR_MODE_OUT";
gpio14.writeInitialValue = true;
gpio14.initialValue      = 1;
gpio14.gpioPin.$assign   = "GPIO88";

gpio15.$name           = "ERROR_OUT1";
gpio15.gpioPin.$assign = "GPIO17";

gpio16.$name           = "ERROR_OUT2";
gpio16.gpioPin.$assign = "GPIO27";

gpio17.$name           = "HALT1";
gpio17.gpioPin.$assign = "GPIO43";

gpio18.$name           = "HALT2";
gpio18.gpioPin.$assign = "GPIO67";

gpio19.$name           = "HALT1_N";
gpio19.gpioPin.$assign = "GPIO47";

gpio20.$name           = "HALT2_N";
gpio20.gpioPin.$assign = "GPIO42";

gpio21.$name           = "STOP1";
gpio21.direction       = "GPIO_DIR_MODE_OUT";
gpio21.gpioPin.$assign = "GPIO46";

gpio22.$name           = "STOP2";
gpio22.direction       = "GPIO_DIR_MODE_OUT";
gpio22.gpioPin.$assign = "GPIO133";

gpio23.$name             = "HSD1";
gpio23.direction         = "GPIO_DIR_MODE_OUT";
gpio23.writeInitialValue = true;
gpio23.gpioPin.$assign   = "GPIO53";

gpio24.$name             = "HSD2";
gpio24.direction         = "GPIO_DIR_MODE_OUT";
gpio24.writeInitialValue = true;
gpio24.gpioPin.$assign   = "GPIO52";

gpio25.$name             = "HSD3";
gpio25.direction         = "GPIO_DIR_MODE_OUT";
gpio25.writeInitialValue = true;
gpio25.gpioPin.$assign   = "GPIO51";

gpio26.$name             = "HSD4";
gpio26.direction         = "GPIO_DIR_MODE_OUT";
gpio26.writeInitialValue = true;
gpio26.gpioPin.$assign   = "GPIO49";

gpio27.$name           = "HSD_ST_1_2";
gpio27.gpioPin.$assign = "GPIO54";

gpio28.$name           = "HSD_ST_3_4";
gpio28.gpioPin.$assign = "GPIO50";

gpio29.$name           = "CARD_DETECT";
gpio29.gpioPin.$assign = "GPIO74";

gpio30.direction         = "GPIO_DIR_MODE_OUT";
gpio30.writeInitialValue = true;
gpio30.$name             = "S_CAN_SKIIP";
gpio30.gpioPin.$assign   = "GPIO45";

gpio31.direction         = "GPIO_DIR_MODE_OUT";
gpio31.writeInitialValue = true;
gpio31.controllerCore    = "GPIO_CORE_CM";
gpio31.$name             = "S_CAN_PUBLIC";
gpio31.gpioPin.$assign   = "GPIO44";

gpio32.direction         = "GPIO_DIR_MODE_OUT";
gpio32.controllerCore    = "GPIO_CORE_CM";
gpio32.writeInitialValue = true;
gpio32.$name             = "S_MCAN";
gpio32.gpioPin.$assign   = "GPIO66";

gpio33.$name           = "RTC_INT";
gpio33.gpioPin.$assign = "GPIO2";

gpio34.$name           = "SBC_INTB";
gpio34.gpioPin.$assign = "GPIO55";

gpio35.$name           = "SBC_FS0B";
gpio35.gpioPin.$assign = "GPIO64";

gpio36.$name           = "SBC_FS1B";
gpio36.gpioPin.$assign = "GPIO65";

gpio37.$name           = "SBC_FCCU0";
gpio37.gpioPin.$assign = "GPIO57";

gpio38.$name           = "SBC_FCCU1";
gpio38.gpioPin.$assign = "GPIO56";

i2c1.$name                  = "I2C_RTC";
i2c1.duty                   = "I2C_DUTYCYCLE_50";
i2c1.bitCount               = "I2C_BITCOUNT_8";
i2c1.dataCount              = 2;
i2c1.targetAddress          = 0x51;
i2c1.enabledInterrupts      = ["I2C_INT_ADDR_TARGET","I2C_INT_ARB_LOST","I2C_INT_NO_ACK","I2C_INT_STOP_CONDITION"];
i2c1.emulationMode          = "I2C_EMULATION_FREE_RUN";
i2c1.i2c.$assign            = "I2CA";
i2c1.i2c.i2c_sdaPin.$assign = "GPIO0";
i2c1.i2c.i2c_sclPin.$assign = "GPIO1";
i2c1.sdaQual.padConfig      = "STD";
i2c1.sclQual.padConfig      = "STD";

gpio11.xint.inputxbar          = inputxbar_input1;
inputxbar_input1.inputxbarGpio = "GPIO40";
inputxbar_input1.$name         = "RTD_DRDYA_Input_XBar";

memcfg.init_MEMCFG_SECT_MSGCPUTOCPU1 = true;
memcfg.init_MEMCFG_SECT_MSGCPUTOCM0  = true;
memcfg.init_MEMCFG_SECT_MSGCPUTOCM1  = true;
memcfg.config_MEMCFG_SECT_LS6        = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS7        = "CLA_prog";
memcfg.config_MEMCFG_SECT_LS5        = "CLA_data";
memcfg.init_MEMCFG_SECT_MSGCPUTOCPU0 = true;
memcfg.init_MEMCFG_SECT_MSGCPUTOCLA1 = true;
memcfg.init_MEMCFG_SECT_MSGCLA1TOCPU = true;

spi1.$name                    = "RTD_SPI";
spi1.useCase                  = "CUSTOM";
spi1.useInterfacePins         = ["SPI@_CLK","SPI@_SIMO","SPI@_SOMI"];
spi1.mode                     = "SPI_MODE_CONTROLLER";
spi1.registerInterrupts       = true;
spi1.enabledInterrupts        = ["SPI_INT_RX_DATA_TX_EMPTY"];
spi1.useFifo                  = false;
spi1.spi.$assign              = "SPIA";
spi1.spi.spi_picoPin.$assign  = "GPIO32";
spi1.spi.spi_pociPin.$assign  = "GPIO33";
spi1.spi.spi_clkPin.$assign   = "GPIO34";
spi1.spiRXInt.enableInterrupt = true;
spi1.spiTXInt.enableInterrupt = true;

spi2.$name                   = "SBC_SPI";
spi2.spi.$assign             = "SPIB";
spi2.spi.spi_picoPin.$assign = "GPIO60";
spi2.spi.spi_pociPin.$assign = "GPIO61";
spi2.spi.spi_clkPin.$assign  = "GPIO58";
spi2.spi.spi_ptePin.$assign  = "GPIO59";

spi3.$name                   = "SD_SPI";
spi3.transferProtocol        = "SPI_PROT_POL0PHA1";
spi3.mode                    = "SPI_MODE_CONTROLLER";
spi3.useCase                 = "CUSTOM";
spi3.useInterfacePins        = ["SPI@_CLK","SPI@_SIMO","SPI@_SOMI"];
spi3.spi.$assign             = "SPIC";
spi3.spi.spi_picoPin.$assign = "GPIO69";
spi3.spi.spi_pociPin.$assign = "GPIO70";
spi3.spi.spi_clkPin.$assign  = "GPIO71";

sync.syncOutSource = "SYSCTL_SYNC_OUT_SRC_EPWM4SYNCOUT";

sysctl.sharedPeripheralAllocate_SYSCTL_PALLOCATE_MCAN_A = true;
sysctl.sharedPeripheralAllocate_SYSCTL_PALLOCATE_CAN_B  = true;

FREERTOS1.$name                    = "myFREERTOS0";
FREERTOS1.CPU_CLOCK_HZ             = 200000000;
FREERTOS1.MAX_PRIORITIES           = 32;
FREERTOS1.MINIMAL_STACK_SIZE       = 256;
FREERTOS1.MAX_TASK_NAME_LEN        = 10;
FREERTOS1.USE_TICK_HOOK            = true;
FREERTOS1.CHECK_FOR_STACK_OVERFLOW = 2;
FREERTOS1.USE_MALLOC_FAILED_HOOK   = true;

FPUfastRTS1.$name = "myFFR0";

CMD.activateCMD = true;
CMD.activeCMD   = "CMD_Config";

